package rvtng.vec

import chisel3._
import chisel3.util._

/*
* 需求：
*    作为所有向量线程的控制模块，管理向量多线程。本模块分为两个模式，循环外模式及循环内模式。
*  - 在循环外模式时，本模块直接从 VecInstQueue 获取指令。
*     - 若相关指令为 Csr/Scoreboard 指令，则直接发射执行并立即弹出相关指令
*     - 若相关指令为 Vec 执行指令，则在下一周期，将模式转换为循环内模式
*  - 在循环内模式时，本模块负责从众多已就绪的 VecThread 中调度选择一个线程发射执行，并取相应线程的指令回写。模块同时监听回写指令信息
*     - 若相关指令为 Csr/Scoreboard 指令，且目前仅剩余一条活跃线程，则说明相应线程执行结束，将相应线程就绪信息回写回 EmptyBoard 供下一轮线程调度。
*        - 若所有线程已完成发射执行，则说明当前 Vec 指令块已执行结束，弹出所有指令并转为循环外模式。
*     - 若相关指令为 Vec 执行指令，则不做任何操作。
*
* 接口：
*    - 取指接口，发出指令偏移，单周期后返回取指结果及有效信息。
*    - 向量任务分派接口，向每个向量子线程分派任务。
*    - 向量任务响应接口，向量子线程反馈执行结束。
*    - 主机响应接口，返回 CSR 指令执行结果。
*
* 优化项目：
*    - 多个 Vec 向量块交叠执行，异步化的 Config 指令执行以掩盖配置和初始化延迟。
*
* */
class VecCtrlTop extends Module {

}
